Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions.AddHolesForTaps
Set true to have holes for taps on straights added to the created fabrication job.
Since:
2019

Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions.#ctor(System.Boolean)
Constructor
addHolesForTaps:
Set true to have holes for taps on straights added to the created fabrication job.
Since:
2019

Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions.#ctor
Default Constructor
Since:
2019

Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions
Options for FabricationPart.SaveAsFabricationJob() method.
Since:
2019